In [ ]:
import numpy as np
import pandas as pd

import pandas._testing as tm

def unpivot(frame):
    N, K = frame.shape
    data = {'value': frame.to_numpy().ravel('F'),
            'variable': np.asarray(frame.columns).repeat(N),
            'date': np.tile(np.asarray(frame.index), K)}
    return pd.DataFrame(data, columns=['date', 'variable', 'value'])


df = unpivot(tm.makeTimeDataFrame(3))
df

         date variable     value
0  2000-01-03        A -0.241521
1  2000-01-04        A  0.647701
2  2000-01-05        A -1.176637
3  2000-01-03        B  0.300049
4  2000-01-04        B -1.432355
5  2000-01-05        B  0.862446
6  2000-01-03        C  1.114874
7  2000-01-04        C  0.857351
8  2000-01-05        C -1.540152
9  2000-01-03        D -1.486984
10 2000-01-04        D  0.347643
11 2000-01-05        D -0.563852

In [ ]:
df.pivot(index='date', columns='variable', values='value')

variable           A         B         C         D
date
2000-01-03 -0.241521  0.300049  1.114874 -1.486984
2000-01-04  0.647701 -1.432355  0.857351  0.347643
2000-01-05 -1.176637  0.862446 -1.540152 -0.563852

# **Module 4 Stack/Unstack**

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ...:                      'foo', 'foo', 'qux', 'qux'],
   ...:                     ['one', 'two', 'one', 'two',
   ...:                      'one', 'two', 'one', 'two']]))
   ...: 

index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

df2 = df[:4]

df2

                     A         B
first second
bar   one     0.577030  2.148304
      two    -1.054862  2.773961
baz   one     0.069495 -0.775799
      two    -0.031995  0.242320

In [ ]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.577030
               B    2.148304
       two     A   -1.054862
               B    2.773961
baz    one     A    0.069495
               B   -0.775799
       two     A   -0.031995
               B    0.242320
dtype: float64

In [ ]:
stacked.unstack()

                     A         B
first second
bar   one     0.577030  2.148304
      two    -1.054862  2.773961
baz   one     0.069495 -0.775799
      two    -0.031995  0.242320